export type Review = {
  name: string;
  text: string;
  image: string;
};

const reviewsData: Review[] = [
  {
    name: 'Оксана',
    text: 'Когда заказывали шкаф-купе, честно, переживали, что не получится, как на картинках. Но ребята нас приятно удивили! Всё сделали под наши размеры, материалы отличные, и качество сборки - без нареканий. Приехали, всё установили быстро и без лишних вопросов. Идеально вписался в нашу спальню. Спасибо, будем заказывать ещё!',
    image: 'https://storage.googleapis.com/t-mebel/Image/ourPage/modal/shafa/3/tablet.webp'
  },
  {
    name: 'Светлана',
    text: 'Я вообще не планировала заказывать кухню под заказ, думала, что всё это будет дорого и долго. Но ребята из этой компании меня убедили. Сделали мне красивую кухню по моим размерам, быстро, и что главное — они реально учли все мои пожелания! Я довольна качеством, кухней пользуюсь уже несколько месяцев, и ни разу не пожалела. Кстати, монтаж тоже прошёл без проблем. Так что советую, если хотите индивидуальный подход.',
    image: 'https://storage.googleapis.com/t-mebel/Image/ourPage/modal/kitchen/4/tablet.webp'
  },
  {
    name: 'Александр',
    text: 'Заказывал встроенный шкаф в детскую комнату. Сначала думал, что будет сложно выбрать дизайн, но менеджер помог подобрать идеальный вариант. Замеры сделали быстро, а сам шкаф изготовили и установили всего за две недели! Качество на высоте, всё сделано аккуратно, и ребёнок теперь в восторге от своего нового шкафа. Спасибо за отличную работу!',
    image: 'https://storage.googleapis.com/t-mebel/Image/ourPage/modal/shafa/1/tablet.webp'
  },
  {
    name: 'Ирина',
    text: 'Заказывали встроенный гардероб в прихожую — всё прошло просто отлично! Сначала помогли с проектом, подсказали, как лучше организовать пространство. Потом всё замерили и изготовили точно в срок. Монтаж занял всего пару часов, всё чисто и аккуратно. Видно, что работают профессионалы. Очень понравился сервис, будем рекомендовать знакомым!',
    image: 'https://storage.googleapis.com/t-mebel/Image/ourPage/modal/shafa/7/tablet.webp'
  },
]

export default reviewsData;

/* 
Подвязываем коментарии под каждую позицию и потом будем их использовать в FullPageCard и в Slider
Пример:
  {
    "id": 1,
    "title": "Современная кухня в светлых тонах с лаконичным дизайном",
    "description": "Эта кухня выполнена в стиле минимализм с акцентом на светлую цветовую гамму. Гладкие фасады без ручек, встроенная техника и продуманная система хранения создают ощущение простора и комфорта. Идеальный выбор для ценителей современного дизайна и функциональности",
    "color": "gray",
    "furnitures": "blum, hpl, mdf",
    "image": "https://storage.googleapis.com/t-mebel/Image/ourPage/modal/kitchen/1/tablet.webp",
    "images": ["https://storage.googleapis.com/t-mebel/Image/ourPage/modal/kitchen/1/tablet.webp"],
    "width": 120,
    "height": 80,
    "rating": 5,
    "categories": ["kitchen"],
    "reviews": [
      {
        "name": "Оксана",
        "text": "Когда заказывали шкаф-купе, честно, переживали, что не получится, как на картинках. Но ребята нас приятно удивили! Всё сделали под наши размеры, материалы отличные, и качество сборки - без нареканий. Приехали, всё установили быстро и без лишних вопросов. Идеально вписался в нашу спальню. Спасибо, будем заказывать ещё!",
        "image": "https://storage.googleapis.com/t-mebel/Image/ourPage/modal/kitchen/1/tablet.webp"
      }
    ]
  },
*/
